In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame(np.arange(12).reshape(3, 4), index = ['NY', 'LA', 'TB'], columns=['A', 'B', 'C', 'D'])
df

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
TB  8  9  10  11

In [3]:
df.index.map(str.lower) #rename the index to lower case

Index(['ny', 'la', 'tb'], dtype='object')

In [4]:
df.index = df.index.map(str.lower)

In [5]:
df

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
tb  8  9  10  11

In [7]:
df.rename(index=str.title, columns=str.lower) #make the index and column names lowercase.

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Tb  8  9  10  11

In [9]:
df.rename(index={'ny': 'New York', 'la': 'Los Angeles', 'tb': 'Tampa Bay'},
         columns={'A':'alpha', 'B':'beta', 'C': 'charlie', 'D': 'delta'}) #rename the index and columns by using a dictionary.

             alpha  beta  charlie  delta
New York         0     1        2      3
Los Angeles      4     5        6      7
Tampa Bay        8     9       10     11

In [10]:
df.rename(index={'ny': 'New York', 'la': 'Los Angeles', 'tb': 'Tampa Bay'},
         columns={'A':'alpha', 'B':'beta', 'C': 'charlie', 'D': 'delta'}, inplace=True) # use inplace=True to perminently rename the index and columns.

In [11]:
df

             alpha  beta  charlie  delta
New York         0     1        2      3
Los Angeles      4     5        6      7
Tampa Bay        8     9       10     11